In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv("Downloads/titanic_data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df_catagorical  = df.select_dtypes(include= 'object')

In [9]:
df_catagorical.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [17]:
# Name and Ticket has no use for analysis
# Sex and Embarked are Nominal data.

## So Only Ordina column "cabin" has to handle

In [27]:
## Odinal Data:

# 1 .Target Encoding
# 2. Mean Encoding

## 1. Target Encoding

In [28]:
# Since the only one ordinal Columns is handle with dependent column (i.e "Survived")

In [14]:
df = df[["Survived","Cabin"]]

In [16]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [18]:
df.isnull().sum()

Survived      0
Cabin       687
dtype: int64

In [22]:
import warnings
warnings.filterwarnings('ignore')

In [23]:
# 1. Fill the Null value with any other string

In [24]:
df['Cabin'] = df["Cabin"].fillna('Praveen')

In [25]:
df["Cabin"].isnull().sum()

0

In [26]:
df["Cabin"].value_counts()

Praveen        687
G6               4
B96 B98          4
C23 C25 C27      4
F2               3
              ...
C86              1
D37              1
D11              1
B4               1
C47              1
Name: Cabin, Length: 148, dtype: int64

In [32]:
# 2. use the Firsr leter of the string

df['Cabin'] = df['Cabin'].astype(str).str[0]

In [35]:
df["Cabin"].value_counts()

P    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [42]:
# 3. find the average of w.r.t Survived

a= df["Survived"].groupby(df["Cabin"]).mean().sort_values(ascending=True).index
a

Index(['T', 'P', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [44]:
# 4. Ranking the each values

b = {j:i for i,j in enumerate(a)}
b

{'T': 0, 'P': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [46]:
df["Cabin"] = df["Cabin"].map(b)

In [47]:
df["Cabin"]

0      1
1      4
2      1
3      4
4      1
      ..
886    1
887    6
888    1
889    4
890    1
Name: Cabin, Length: 891, dtype: int64

In [48]:
df.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

In [ ]:
## Successfully handled the Ordinal data.

# In next step concat this in Data Frame